#Generated by Fabric Compiler ( version 2020.1-SP4 <build 56547> ) at Wed Dec  9 16:51:40 2020

add_design "F:/mdio_1209/source/mdio.v"
add_constraint "F:/mdio_1209/mdio_1209.fdc"
set_arch -family Logos -device PGL25G -speedgrade -6 -package FBG256
synthesize -synplify_pro -selected_syn_tool_opt 1 
set_arch -family Logos -device PGL25G -speedgrade -6 -package FBG256
synthesize -synplify_pro -selected_syn_tool_opt 1 
add_fic "F:/mdio_1209/mdio_inserter.fic"
set_arch -family Logos -device PGL25G -speedgrade -6 -package FBG256
synthesize -synplify_pro -selected_syn_tool_opt 1 
dev_map 
pnr 
report_timing 
gen_bit_stream 
set_arch -family Logos -device PGL25G -speedgrade -6 -package FBG256
compile 
synthesize -ads -selected_syn_tool_opt 2 
dev_map 
set_arch -family Logos -device PGL25G -speedgrade -6 -package FBG256
synthesize -synplify_pro -selected_syn_tool_opt 1 
dev_map 
pnr 
report_timing 
gen_bit_stream 
set_arch -family Logos -device PGL25G -speedgrade -6 -package FBG256
synthesize -synplify_pro -selected_syn_tool_opt 1 
dev_map 
set_arch -family Logos -device PGL25G -speedgrade -6 -package FBG256
synthesize -synplify_pro -selected_syn_tool_opt 1 
set_arch -family Logos -device PGL25G -speedgrade -6 -package FBG256
synthesize -synplify_pro -selected_syn_tool_opt 1 
dev_map 
set_arch -family Logos -device PGL25G -speedgrade -6 -package FBG256
synthesize -synplify_pro -selected_syn_tool_opt 1 
set_arch -family Logos -device PGL25G -speedgrade -6 -package FBG256
synthesize -synplify_pro -selected_syn_tool_opt 1 
set_arch -family Logos -device PGL25G -speedgrade -6 -package FBG256
synthesize -synplify_pro -selected_syn_tool_opt 1 
set_arch -family Logos -device PGL25G -speedgrade -6 -package FBG256
synthesize -synplify_pro -selected_syn_tool_opt 1 
set_arch -family Logos -device PGL25G -speedgrade -6 -package FBG256
synthesize -synplify_pro -selected_syn_tool_opt 1 
set_arch -family Logos -device PGL25G -speedgrade -6 -package FBG256
synthesize -synplify_pro -selected_syn_tool_opt 1 
set_arch -family Logos -device PGL25G -speedgrade -6 -package FBG256
synthesize -synplify_pro -selected_syn_tool_opt 1 
dev_map 
pnr 
report_timing 
gen_bit_stream 
set_arch -family Logos -device PGL25G -speedgrade -6 -package FBG256
synthesize -synplify_pro -selected_syn_tool_opt 1 
dev_map 
set_arch -family Logos -device PGL25G -speedgrade -6 -package FBG256
synthesize -synplify_pro -selected_syn_tool_opt 1 
dev_map 
pnr 
report_timing 
gen_bit_stream 
set_arch -family Logos -device PGL25G -speedgrade -6 -package FBG256
synthesize -synplify_pro -selected_syn_tool_opt 1 
set_arch -family Logos -device PGL25G -speedgrade -6 -package FBG256
synthesize -synplify_pro -selected_syn_tool_opt 1 
dev_map 
pnr 
report_timing 
gen_bit_stream 
set_arch -family Logos -device PGL25G -speedgrade -6 -package FBG256
synthesize -synplify_pro -selected_syn_tool_opt 1 
dev_map 
pnr 
report_timing 
gen_bit_stream 
set_arch -family Logos -device PGL25G -speedgrade -6 -package FBG256
synthesize -synplify_pro -selected_syn_tool_opt 1 
dev_map 
pnr 
report_timing 
gen_bit_stream 
set_arch -family Logos -device PGL25G -speedgrade -6 -package FBG256
synthesize -synplify_pro -selected_syn_tool_opt 1 
dev_map 
pnr 
report_timing 
gen_bit_stream 
set_arch -family Logos -device PGL25G -speedgrade -6 -package FBG256
synthesize -synplify_pro -selected_syn_tool_opt 1 
set_arch -family Logos -device PGL25G -speedgrade -6 -package FBG256
synthesize -synplify_pro -selected_syn_tool_opt 1 
set_arch -family Logos -device PGL25G -speedgrade -6 -package FBG256
synthesize -synplify_pro -selected_syn_tool_opt 1 
set_arch -family Logos -device PGL25G -speedgrade -6 -package FBG256
synthesize -synplify_pro -selected_syn_tool_opt 1 
dev_map 
pnr 
report_timing 
gen_bit_stream 
set_arch -family Logos -device PGL25G -speedgrade -6 -package FBG256
synthesize -synplify_pro -selected_syn_tool_opt 1 
dev_map 
pnr 
report_timing 
gen_bit_stream 
set_arch -family Logos -device PGL25G -speedgrade -6 -package FBG256
synthesize -synplify_pro -selected_syn_tool_opt 1 
dev_map 
pnr 
report_timing 
gen_bit_stream 
set_arch -family Logos -device PGL25G -speedgrade -6 -package FBG256
synthesize -synplify_pro -selected_syn_tool_opt 1 
set_arch -family Logos -device PGL25G -speedgrade -6 -package FBG256
synthesize -synplify_pro -selected_syn_tool_opt 1 
set_arch -family Logos -device PGL25G -speedgrade -6 -package FBG256
synthesize -synplify_pro -selected_syn_tool_opt 1 
dev_map 
pnr 
report_timing 
gen_bit_stream 
set_arch -family Logos -device PGL25G -speedgrade -6 -package FBG256
synthesize -synplify_pro -selected_syn_tool_opt 1 
dev_map 
set_arch -family Logos -device PGL25G -speedgrade -6 -package FBG256
synthesize -synplify_pro -selected_syn_tool_opt 1 
dev_map 
set_arch -family Logos -device PGL25G -speedgrade -6 -package FBG256
synthesize -synplify_pro -selected_syn_tool_opt 1 
dev_map 
set_arch -family Logos -device PGL25G -speedgrade -6 -package FBG256
synthesize -synplify_pro -selected_syn_tool_opt 1 
dev_map 
set_arch -family Logos -device PGL25G -speedgrade -6 -package FBG256
synthesize -synplify_pro -selected_syn_tool_opt 1 
dev_map 
pnr 
report_timing 
gen_bit_stream 
set_arch -family Logos -device PGL25G -speedgrade -6 -package FBG256
synthesize -synplify_pro -selected_syn_tool_opt 1 
dev_map 
pnr 
report_timing 
gen_bit_stream 
set_arch -family Logos -device PGL25G -speedgrade -6 -package FBG256
synthesize -synplify_pro -selected_syn_tool_opt 1 
dev_map 
set_arch -family Logos -device PGL25G -speedgrade -6 -package FBG256
synthesize -synplify_pro -selected_syn_tool_opt 1 
dev_map 
pnr 
report_timing 
gen_bit_stream 
set_arch -family Logos -device PGL25G -speedgrade -6 -package FBG256
synthesize -synplify_pro -selected_syn_tool_opt 1 
dev_map 
pnr 
report_timing 
gen_bit_stream 
set_arch -family Logos -device PGL25G -speedgrade -6 -package FBG256
synthesize -synplify_pro -selected_syn_tool_opt 1 
dev_map 
dev_map 
pnr 
report_timing 
gen_bit_stream 
set_arch -family Logos -device PGL25G -speedgrade -6 -package FBG256
synthesize -synplify_pro -selected_syn_tool_opt 1 
dev_map 
pnr 
report_timing 
gen_bit_stream 
set_arch -family Logos -device PGL25G -speedgrade -6 -package FBG256
synthesize -synplify_pro -selected_syn_tool_opt 1 
dev_map 
dev_map 
pnr 
report_timing 
gen_bit_stream 
set_arch -family Logos -device PGL25G -speedgrade -6 -package FBG256
synthesize -synplify_pro -selected_syn_tool_opt 1 
dev_map 
pnr 
report_timing 
gen_bit_stream 
dev_map 
pnr 
report_timing 
gen_bit_stream 
set_arch -family Logos -device PGL25G -speedgrade -6 -package FBG256
synthesize -synplify_pro -selected_syn_tool_opt 1 
dev_map 
dev_map 
pnr 
report_timing 
gen_bit_stream 
set_arch -family Logos -device PGL25G -speedgrade -6 -package FBG256
synthesize -synplify_pro -selected_syn_tool_opt 1 
dev_map 
pnr 
report_timing 
gen_bit_stream 
set_arch -family Logos -device PGL25G -speedgrade -6 -package FBG256
synthesize -synplify_pro -selected_syn_tool_opt 1 
dev_map 
pnr 
report_timing 
gen_bit_stream 
set_arch -family Logos -device PGL25G -speedgrade -6 -package FBG256
synthesize -synplify_pro -selected_syn_tool_opt 1 
set_arch -family Logos -device PGL25G -speedgrade -6 -package FBG256
synthesize -synplify_pro -selected_syn_tool_opt 1 
set_arch -family Logos -device PGL25G -speedgrade -6 -package FBG256
synthesize -synplify_pro -selected_syn_tool_opt 1 
set_arch -family Logos -device PGL25G -speedgrade -6 -package FBG256
synthesize -synplify_pro -selected_syn_tool_opt 1 
dev_map 
set_arch -family Logos -device PGL25G -speedgrade -6 -package FBG256
synthesize -synplify_pro -selected_syn_tool_opt 1 
set_arch -family Logos -device PGL25G -speedgrade -6 -package FBG256
synthesize -synplify_pro -selected_syn_tool_opt 1 
set_arch -family Logos -device PGL25G -speedgrade -6 -package FBG256
synthesize -synplify_pro -selected_syn_tool_opt 1 
set_arch -family Logos -device PGL25G -speedgrade -6 -package FBG256
synthesize -synplify_pro -selected_syn_tool_opt 1 
set_arch -family Logos -device PGL25G -speedgrade -6 -package FBG256
synthesize -synplify_pro -selected_syn_tool_opt 1 
set_arch -family Logos -device PGL25G -speedgrade -6 -package FBG256
synthesize -synplify_pro -selected_syn_tool_opt 1 
dev_map 
pnr 
report_timing 
gen_bit_stream 
gen_bit_stream 
set_arch -family Logos -device PGL25G -speedgrade -6 -package FBG256
synthesize -synplify_pro -selected_syn_tool_opt 1 
set_arch -family Logos -device PGL25G -speedgrade -6 -package FBG256
synthesize -synplify_pro -selected_syn_tool_opt 1 
set_arch -family Logos -device PGL25G -speedgrade -6 -package FBG256
synthesize -synplify_pro -selected_syn_tool_opt 1 
set_arch -family Logos -device PGL25G -speedgrade -6 -package FBG256
synthesize -synplify_pro -selected_syn_tool_opt 1 
set_arch -family Logos -device PGL25G -speedgrade -6 -package FBG256
synthesize -synplify_pro -selected_syn_tool_opt 1 
set_arch -family Logos -device PGL25G -speedgrade -6 -package FBG256
synthesize -synplify_pro -selected_syn_tool_opt 1 
set_arch -family Logos -device PGL25G -speedgrade -6 -package FBG256
synthesize -synplify_pro -selected_syn_tool_opt 1 
dev_map 
pnr 
report_timing 
gen_bit_stream 
set_arch -family Logos -device PGL25G -speedgrade -6 -package FBG256
synthesize -synplify_pro -selected_syn_tool_opt 1 
set_arch -family Logos -device PGL25G -speedgrade -6 -package FBG256
synthesize -synplify_pro -selected_syn_tool_opt 1 
dev_map 
pnr 
report_timing 
gen_bit_stream 
set_arch -family Logos -device PGL25G -speedgrade -6 -package FBG256
synthesize -synplify_pro -selected_syn_tool_opt 1 
dev_map 
pnr 
report_timing 
gen_bit_stream 
dev_map 
pnr 
report_timing 
gen_bit_stream 
dev_map 
pnr 
report_timing 
gen_bit_stream 
set_arch -family Logos -device PGL25G -speedgrade -6 -package FBG256
synthesize -synplify_pro -selected_syn_tool_opt 1 
dev_map 
pnr 
report_timing 
gen_bit_stream 
set_arch -family Logos -device PGL25G -speedgrade -6 -package FBG256
synthesize -synplify_pro -selected_syn_tool_opt 1 
dev_map 
dev_map 
pnr 
report_timing 
gen_bit_stream 
set_arch -family Logos -device PGL25G -speedgrade -6 -package FBG256
synthesize -synplify_pro -selected_syn_tool_opt 1 
dev_map 
pnr 
report_timing 
gen_bit_stream 
set_arch -family Logos -device PGL25G -speedgrade -6 -package FBG256
synthesize -synplify_pro -selected_syn_tool_opt 1 
dev_map 
pnr 
report_timing 
gen_bit_stream 
set_arch -family Logos -device PGL25G -speedgrade -6 -package FBG256
compile 
synthesize -ads -selected_syn_tool_opt 2 
dev_map 
dev_map 
pnr 
report_timing 
gen_bit_stream 
set_arch -family Logos -device PGL25G -speedgrade -6 -package FBG256
synthesize -synplify_pro -selected_syn_tool_opt 1 
set_arch -family Logos -device PGL25G -speedgrade -6 -package FBG256
synthesize -synplify_pro -selected_syn_tool_opt 1 
set_arch -family Logos -device PGL25G -speedgrade -6 -package FBG256
synthesize -synplify_pro -selected_syn_tool_opt 1 
set_arch -family Logos -device PGL25G -speedgrade -6 -package FBG256
synthesize -synplify_pro -selected_syn_tool_opt 1 
set_arch -family Logos -device PGL25G -speedgrade -6 -package FBG256
synthesize -synplify_pro -selected_syn_tool_opt 1 
set_arch -family Logos -device PGL25G -speedgrade -6 -package FBG256
synthesize -synplify_pro -selected_syn_tool_opt 1 
set_arch -family Logos -device PGL25G -speedgrade -6 -package FBG256
synthesize -synplify_pro -selected_syn_tool_opt 1 
set_arch -family Logos -device PGL25G -speedgrade -6 -package FBG256
synthesize -synplify_pro -selected_syn_tool_opt 1 
set_arch -family Logos -device PGL25G -speedgrade -6 -package FBG256
synthesize -synplify_pro -selected_syn_tool_opt 1 
set_arch -family Logos -device PGL25G -speedgrade -6 -package FBG256
synthesize -synplify_pro -selected_syn_tool_opt 1 
set_arch -family Logos -device PGL25G -speedgrade -6 -package FBG256
synthesize -synplify_pro -selected_syn_tool_opt 1 
remove_constraint  -logic -fdc "F:/mdio_1211/mdio_1209.fdc"
add_constraint "F:/mdio_1211/mdio_1209.fdc"
set_arch -family Logos -device PGL25G -speedgrade -6 -package FBG256
synthesize -synplify_pro -selected_syn_tool_opt 1 
set_arch -family Logos -device PGL25G -speedgrade -6 -package FBG256
synthesize -synplify_pro -selected_syn_tool_opt 1 
dev_map 
pnr 
report_timing 
gen_bit_stream 
set_arch -family Logos -device PGL25G -speedgrade -6 -package FBG256
synthesize -synplify_pro -selected_syn_tool_opt 1 
dev_map 
dev_map 
pnr 
report_timing 
gen_bit_stream 
set_arch -family Logos -device PGL25G -speedgrade -6 -package FBG256
synthesize -synplify_pro -selected_syn_tool_opt 1 
dev_map 
pnr 
report_timing 
gen_bit_stream 
set_arch -family Logos -device PGL25G -speedgrade -6 -package FBG256
synthesize -synplify_pro -selected_syn_tool_opt 1 
dev_map 
pnr 
report_timing 
gen_bit_stream 
set_arch -family Logos -device PGL25G -speedgrade -6 -package FBG256
synthesize -synplify_pro -selected_syn_tool_opt 1 
dev_map 
pnr 
report_timing 
gen_bit_stream 
remove_constraint  -logic -fdc "F:/mdio_1211/mdio_1209.fdc"
add_constraint "F:/mdio_1211/mdio_1209.fdc"
set_arch -family Logos -device PGL25G -speedgrade -6 -package FBG256
synthesize -synplify_pro -selected_syn_tool_opt 1 
set_arch -family Logos -device PGL25G -speedgrade -6 -package FBG256
synthesize -synplify_pro -selected_syn_tool_opt 1 
set_arch -family Logos -device PGL25G -speedgrade -6 -package FBG256
synthesize -synplify_pro -selected_syn_tool_opt 1 
set_arch -family Logos -device PGL25G -speedgrade -6 -package FBG256
synthesize -synplify_pro -selected_syn_tool_opt 1 
dev_map 
pnr 
report_timing 
gen_bit_stream 
gen_netlist 
report_power 
set_arch -family Logos -device PGL25G -speedgrade -6 -package FBG256
synthesize -synplify_pro -selected_syn_tool_opt 1 
dev_map 
pnr 
report_timing 
gen_bit_stream 
set_arch -family Logos -device PGL25G -speedgrade -6 -package FBG256
synthesize -synplify_pro -selected_syn_tool_opt 1 
dev_map 
pnr 
report_timing 
gen_bit_stream 
set_arch -family Logos -device PGL25G -speedgrade -6 -package FBG256
synthesize -synplify_pro -selected_syn_tool_opt 1 
dev_map 
pnr 
report_timing 
gen_bit_stream 
set_arch -family Logos -device PGL25G -speedgrade -6 -package FBG256
synthesize -synplify_pro -selected_syn_tool_opt 1 
dev_map 
pnr 
report_timing 
gen_bit_stream 
set_arch -family Logos -device PGL25G -speedgrade -6 -package FBG256
synthesize -synplify_pro -selected_syn_tool_opt 1 
dev_map 
pnr 
report_timing 
gen_bit_stream 
set_arch -family Logos -device PGL25G -speedgrade -6 -package FBG256
synthesize -synplify_pro -selected_syn_tool_opt 1 
dev_map 
pnr 
report_timing 
gen_bit_stream 
set_arch -family Logos -device PGL25G -speedgrade -6 -package FBG256
synthesize -synplify_pro -selected_syn_tool_opt 1 
dev_map 
pnr 
report_timing 
gen_bit_stream 
set_arch -family Logos -device PGL25G -speedgrade -6 -package FBG256
synthesize -synplify_pro -selected_syn_tool_opt 1 
dev_map 
pnr 
report_timing 
gen_bit_stream 
set_arch -family Logos -device PGL25G -speedgrade -6 -package FBG256
synthesize -synplify_pro -selected_syn_tool_opt 1 
dev_map 
set_arch -family Logos -device PGL25G -speedgrade -6 -package FBG256
synthesize -synplify_pro -selected_syn_tool_opt 1 
dev_map 
pnr 
report_timing 
gen_bit_stream 
set_arch -family Logos -device PGL25G -speedgrade -6 -package FBG256
synthesize -synplify_pro -selected_syn_tool_opt 1 
dev_map 
pnr 
report_timing 
gen_bit_stream 
set_arch -family Logos -device PGL25G -speedgrade -6 -package FBG256
synthesize -synplify_pro -selected_syn_tool_opt 1 
dev_map 
pnr 
report_timing 
gen_bit_stream 
set_arch -family Logos -device PGL25G -speedgrade -6 -package FBG256
synthesize -synplify_pro -selected_syn_tool_opt 1 
dev_map 
pnr 
report_timing 
gen_bit_stream 
set_arch -family Logos -device PGL25G -speedgrade -6 -package FBG256
synthesize -synplify_pro -selected_syn_tool_opt 1 
dev_map 
pnr 
report_timing 
gen_bit_stream 
set_arch -family Logos -device PGL25G -speedgrade -6 -package FBG256
synthesize -synplify_pro -selected_syn_tool_opt 1 
dev_map 
pnr 
report_timing 
gen_bit_stream 
set_arch -family Logos -device PGL25G -speedgrade -6 -package FBG256
synthesize -synplify_pro -selected_syn_tool_opt 1 
dev_map 
set_arch -family Logos -device PGL25G -speedgrade -6 -package FBG256
synthesize -synplify_pro -selected_syn_tool_opt 1 
dev_map 
set_arch -family Logos -device PGL25G -speedgrade -6 -package FBG256
synthesize -synplify_pro -selected_syn_tool_opt 1 
dev_map 
pnr 
report_timing 
gen_bit_stream 
set_arch -family Logos -device PGL25G -speedgrade -6 -package FBG256
synthesize -synplify_pro -selected_syn_tool_opt 1 
dev_map 
set_arch -family Logos -device PGL25G -speedgrade -6 -package FBG256
synthesize -synplify_pro -selected_syn_tool_opt 1 
dev_map 
pnr 
report_timing 
gen_bit_stream 
set_arch -family Logos -device PGL25G -speedgrade -6 -package FBG256
synthesize -synplify_pro -selected_syn_tool_opt 1 
dev_map 
pnr 
report_timing 
gen_bit_stream 
set_arch -family Logos -device PGL25G -speedgrade -6 -package FBG256
synthesize -synplify_pro -selected_syn_tool_opt 1 
dev_map 
pnr 
report_timing 
gen_bit_stream 
set_arch -family Logos -device PGL25G -speedgrade -6 -package FBG256
synthesize -synplify_pro -selected_syn_tool_opt 1 
dev_map 
pnr 
report_timing 
gen_bit_stream 
set_arch -family Logos -device PGL25G -speedgrade -6 -package FBG256
synthesize -synplify_pro -selected_syn_tool_opt 1 
dev_map 
pnr 
report_timing 
gen_bit_stream 
set_arch -family Logos -device PGL25G -speedgrade -6 -package FBG256
synthesize -synplify_pro -selected_syn_tool_opt 1 
dev_map 
set_arch -family Logos -device PGL25G -speedgrade -6 -package FBG256
synthesize -synplify_pro -selected_syn_tool_opt 1 
dev_map 
pnr 
report_timing 
gen_bit_stream 
set_arch -family Logos -device PGL25G -speedgrade -6 -package FBG256
synthesize -synplify_pro -selected_syn_tool_opt 1 
dev_map 
pnr 
report_timing 
gen_bit_stream 
set_arch -family Logos -device PGL25G -speedgrade -6 -package FBG256
synthesize -synplify_pro -selected_syn_tool_opt 1 
dev_map 
pnr 
report_timing 
gen_bit_stream 
set_arch -family Logos -device PGL25G -speedgrade -6 -package FBG256
synthesize -synplify_pro -selected_syn_tool_opt 1 
dev_map 
pnr 
report_timing 
gen_bit_stream 
set_arch -family Logos -device PGL25G -speedgrade -6 -package FBG256
synthesize -synplify_pro -selected_syn_tool_opt 1 
dev_map 
pnr 
report_timing 
gen_bit_stream 
set_arch -family Logos -device PGL25G -speedgrade -6 -package FBG256
synthesize -synplify_pro -selected_syn_tool_opt 1 
dev_map 
pnr 
report_timing 
gen_bit_stream 
set_arch -family Logos -device PGL25G -speedgrade -6 -package FBG256
synthesize -synplify_pro -selected_syn_tool_opt 1 
dev_map 
pnr 
report_timing 
gen_bit_stream 
set_arch -family Logos -device PGL25G -speedgrade -6 -package FBG256
synthesize -synplify_pro -selected_syn_tool_opt 1 
dev_map 
pnr 
report_timing 
gen_bit_stream 
set_arch -family Logos -device PGL25G -speedgrade -6 -package FBG256
synthesize -synplify_pro -selected_syn_tool_opt 1 
dev_map 
pnr 
report_timing 
gen_bit_stream 
set_arch -family Logos -device PGL25G -speedgrade -6 -package FBG256
synthesize -synplify_pro -selected_syn_tool_opt 1 
dev_map 
set_arch -family Logos -device PGL25G -speedgrade -6 -package FBG256
synthesize -synplify_pro -selected_syn_tool_opt 1 
dev_map 
set_arch -family Logos -device PGL25G -speedgrade -6 -package FBG256
synthesize -synplify_pro -selected_syn_tool_opt 1 
dev_map 
pnr 
report_timing 
gen_bit_stream 
set_arch -family Logos -device PGL25G -speedgrade -6 -package FBG256
synthesize -synplify_pro -selected_syn_tool_opt 1 
dev_map 
pnr 
report_timing 
gen_bit_stream 
set_arch -family Logos -device PGL25G -speedgrade -6 -package FBG256
synthesize -synplify_pro -selected_syn_tool_opt 1 
dev_map 
pnr 
report_timing 
gen_bit_stream 
set_arch -family Logos -device PGL25G -speedgrade -6 -package FBG256
synthesize -synplify_pro -selected_syn_tool_opt 1 
dev_map 
pnr 
report_timing 
gen_bit_stream 
set_arch -family Logos -device PGL25G -speedgrade -6 -package FBG256
synthesize -synplify_pro -selected_syn_tool_opt 1 
dev_map 
pnr 
report_timing 
gen_bit_stream 
set_arch -family Logos -device PGL25G -speedgrade -6 -package FBG256
synthesize -synplify_pro -selected_syn_tool_opt 1 
dev_map 
pnr 
report_timing 
gen_bit_stream 
set_arch -family Logos -device PGL25G -speedgrade -6 -package FBG256
synthesize -synplify_pro -selected_syn_tool_opt 1 
dev_map 
pnr 
report_timing 
gen_bit_stream 
set_arch -family Logos -device PGL25G -speedgrade -6 -package FBG256
synthesize -synplify_pro -selected_syn_tool_opt 1 
dev_map 
pnr 
report_timing 
gen_bit_stream 
set_arch -family Logos -device PGL25G -speedgrade -6 -package FBG256
synthesize -synplify_pro -selected_syn_tool_opt 1 
dev_map 
pnr 
report_timing 
gen_bit_stream 
set_arch -family Logos -device PGL25G -speedgrade -6 -package FBG256
synthesize -synplify_pro -selected_syn_tool_opt 1 
dev_map 
pnr 
report_timing 
gen_bit_stream 
set_arch -family Logos -device PGL25G -speedgrade -6 -package FBG256
synthesize -synplify_pro -selected_syn_tool_opt 1 
dev_map 
pnr 
report_timing 
gen_bit_stream 
set_arch -family Logos -device PGL25G -speedgrade -6 -package FBG256
synthesize -synplify_pro -selected_syn_tool_opt 1 
dev_map 
pnr 
report_timing 
gen_bit_stream 
set_arch -family Logos -device PGL25G -speedgrade -6 -package FBG256
synthesize -synplify_pro -selected_syn_tool_opt 1 
dev_map 
pnr 
report_timing 
gen_bit_stream 
set_arch -family Logos -device PGL25G -speedgrade -6 -package FBG256
synthesize -synplify_pro -selected_syn_tool_opt 1 
dev_map 
pnr 
report_timing 
gen_bit_stream 
set_arch -family Logos -device PGL25G -speedgrade -6 -package FBG256
synthesize -synplify_pro -selected_syn_tool_opt 1 
dev_map 
pnr 
report_timing 
gen_bit_stream 
set_arch -family Logos -device PGL25G -speedgrade -6 -package FBG256
synthesize -synplify_pro -selected_syn_tool_opt 1 
dev_map 
pnr 
report_timing 
gen_bit_stream 
set_arch -family Logos -device PGL25G -speedgrade -6 -package FBG256
synthesize -synplify_pro -selected_syn_tool_opt 1 
dev_map 
dev_map 
pnr 
report_timing 
gen_bit_stream 
set_arch -family Logos -device PGL25G -speedgrade -6 -package FBG256
synthesize -synplify_pro -selected_syn_tool_opt 1 
dev_map 
pnr 
report_timing 
gen_bit_stream 
set_arch -family Logos -device PGL25G -speedgrade -6 -package FBG256
synthesize -synplify_pro -selected_syn_tool_opt 1 
dev_map 
pnr 
report_timing 
gen_bit_stream 
